package polymorphism;

public class Read {

    /**
     * 多态（也称作动态绑定、后期绑定或运行时绑定）
     * <p>
     * 在面向对象的程序设计语言中，多态是继数据抽象和继承之后的第三种基本特征。
     * <p>
     * 多态通过分离做什么和怎么做，从另一角度将接囗和实现分离开来。多态不
     * 但能够改善代码的组织结构和可读性，还能够创建可扩展的程序一即无论在项
     * 目最初创建时还是在需要添加新功能时都可以"生长"的程序。
     * <p>
     * "封装"通过合并特征和行为来创建新的数据类型。
     * <p>
     * "实现隐藏"则通过将细节"私有化"把接囗和实现分离开来。
     * <p>
     * 这种类型的组织机制对那些拥有过程化程序设计背景的人来说，更容易理解。
     * <p>
     * 而多态的作用则是消除类型之间的耦合关系。
     * <p>
     * 在前一章中我们已经知道，继承允许将对象视为它自己本身的类型或其基类型来加
     * 以处理。这种能力极为重要，因为它允许将多种类型（从同一基类导出的）视为
     * 同一类型来处理，而同一份代码也就可以毫无差别地运行在这些不同类型之上了。
     * <p>
     * 多态方法调用允许一种类型表现出与其他相似类型之间的区别，只要它们都
     * 是从同一基类导出而来的。
     * <p>
     * 这种区别是根据方法行为的不同而表示出来的，虽然这些方法都可以通过同一个基类来调用。
     * <p>
     * <p>
     * 在本章中，通过一些基本、简单的例子（这些例子中所有与多态无关的代码
     * 都被删掉，只剩下与多态有关的部分），深入浅出地介绍多态（也称作动态绑定、后期绑定或运行时绑定）
     */
    private void say() {

    }
}
